//Просте число має тільки два дільника,
// 1 і саме по собі, всі інші складені.
// На початку ставимо умову, що число повинно бути більше 1,
// Якщо хоча б одне число ділить num без залишку, число є складеним.
//Використання: викликаем функцию с аргументом у вигляді цілого додатнього числа
//наприклад: console.log(SimpleNumer(10));
function SimpleNumer(num) {
      if (num > 1) {
        for (let i = 2; i < num; i++) {
            if (num % i == 0) {
                return "Число є складеним";
            }
        }
        return "Просте число";
    } else {
        return "Число має бути більше 1";
    }
}
